1. `Series`: Representa una estructura de datos unidimensional similar a un array o una columna en una tabla. Cada elemento en una Serie tiene un índice asociado que permite acceder a los datos de forma individual.
2. `DataFrame`: Representa una estructura de datos bidimensional similar a una tabla de una base de datos o una hoja de cálculo de Excel. Consiste en una colección de Series organizadas en columnas. Los DataFrames son especialmente útiles para el análisis de datos tabulares y ofrecen una gran cantidad de funcionalidades para manipular y analizar los datos.

In [1]:
# antes de empezar importamos la librería de NumPy para poder trabajar con todos sus métodos. 
import numpy as np

In [2]:
# importamos la pandas para poder trabajar en la lección
import pandas as pd

C:\Users\femes\AppData\Local\Temp\ipykernel_27240\1984950228.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
valores = [7,5,9,3,2,8,1]
indices = ["lunes","martes","miercoles","jueves","viernes","sabado","domingo"]

In [4]:
serie_listas = pd.Series(valores,index= indices)
serie_listas

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

In [5]:
resultado = zip(indices, valores)
print(list(resultado))

[('lunes', 7), ('martes', 5), ('miercoles', 9), ('jueves', 3), ('viernes', 2), ('sabado', 8), ('domingo', 1)]

In [6]:
dicc= {}

for clave, valor in zip(indices, valores):
    dicc[clave] = valor

print(dicc)

{'lunes': 7, 'martes': 5, 'miercoles': 9, 'jueves': 3, 'viernes': 2, 'sabado': 8, 'domingo': 1}

In [7]:
Series_diccionario = pd.Series(dicc)
Series_diccionario

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

In [8]:
# tiene forma de object
type(Series_diccionario)

display("La serie con la que vamos a trabajar es:", Series_diccionario)
print("---------------------------")
# utilizamos el método index que nos va a devolver todos los índices 
# fijaos como en este caso nos ha devuelto todos los índices de nuestra Serie, es decir, los nombres de las alumnas
print(f"El método 'index' nos devuelve los índices de la Serie: {Series_diccionario.index}")
print("---------------------------")
# ahora utilizamos el método 'values' nos devuelve todos los valores de la Serie
# en este caso los números que teníamos
print(f"El método 'values' nos devuelve los valores de la Serie: {Series_diccionario.values}")
print("---------------------------")

'La serie con la que vamos a trabajar es:'

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

---------------------------
El método 'index' nos devuelve los índices de la Serie: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
---------------------------
El método 'values' nos devuelve los valores de la Serie: [7 5 9 3 2 8 1]
---------------------------

In [9]:
#utilizando el método 'shape' nos devuelve el número de "filas" que tenemos en la Serie
print(f"El método 'shape' nos devuelve la forma de la Serie: {Series_diccionario.shape}")
print("---------------------------")
#utilizando el método 'size' nos devuelve el número de elementos que tenemos en la Serie
print(f"El método 'size' nos devuelve el número de elementos de la Serie: {Series_diccionario.size}")
print("---------------------------")
#utilizando el método 'dtypes' nos devuelve el tipo de datos de la Serie
print(f"El método 'dtypes' nos devuelve el tipo de datos de la Serie: {Series_diccionario.dtypes}")

El método 'shape' nos devuelve la forma de la Serie: (7,)
---------------------------
El método 'size' nos devuelve el número de elementos de la Serie: 7
---------------------------
El método 'dtypes' nos devuelve el tipo de datos de la Serie: int64

In [10]:
Series_diccionario

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

In [11]:
#Extrae el valor para el idice lunes
Series_diccionario[0]

C:\Users\femes\AppData\Local\Temp\ipykernel_27240\361986480.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Series_diccionario[0]

7

In [12]:
Series_diccionario[0:3]

lunes        7
martes       5
miercoles    9
dtype: int64

In [13]:
Series_diccionario[[0,6]]

C:\Users\femes\AppData\Local\Temp\ipykernel_27240\2492876941.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Series_diccionario[[0,6]]

lunes      7
domingo    1
dtype: int64

# turno de Data Frame

In [14]:
array= np.random.rand(4,3)
array

array([[0.37168736, 0.5241612 , 0.20052346],
       [0.5710486 , 0.23414374, 0.00110273],
       [0.07981533, 0.88184389, 0.84308746],
       [0.83201176, 0.78030605, 0.86164332]])

In [15]:
df_array = pd.DataFrame(array, columns=("España","Francia","italia"))
df_array

     España   Francia    italia
0  0.371687  0.524161  0.200523
1  0.571049  0.234144  0.001103
2  0.079815  0.881844  0.843087
3  0.832012  0.780306  0.861643

In [43]:
df_medallas = pd.read_csv("./medallas.csv")

In [44]:
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

In [42]:
df_array

     España   Francia    italia
0  0.371687  0.524161  0.200523
1  0.571049  0.234144  0.001103
2  0.079815  0.881844  0.843087
3  0.832012  0.780306  0.861643

In [45]:
df_medallas.loc[6,:]

Unnamed: 0            7
País          Tailandia
Oro                 132
Plata               175
Bronce              278
Name: 6, dtype: object

In [48]:
df_medallas.loc[df_medallas['País'] == 'Tailandia']

   Unnamed: 0       País  Oro  Plata  Bronce
6           7  Tailandia  132    175     278

In [47]:
df_medallas.columns

Index(['Unnamed: 0', 'País', 'Oro', 'Plata', 'Bronce'], dtype='object')

In [49]:
df_medallas.loc[[0,3], :]

   Unnamed: 0   País   Oro  Plata  Bronce
0           1  China  1473    994     720
3           4   Irán   179    181     197

In [56]:
df_medallas.loc[[0,3], "Oro":"Bronce"]

    Oro  Plata  Bronce
0  1473    994     720
3   179    181     197

In [58]:
df_medallas.iloc[5,:]

Unnamed: 0        6
País          India
Oro             154
Plata           202
Bronce          315
Name: 5, dtype: object

In [ ]:
df_medallas = df_medallas.iloc[1,:,2]